{"id":26576,"date":"2023-12-26T22:00:55","date_gmt":"2023-12-26T21:00:55","guid":{"rendered":"https:\/\/cambridgesocietyofparis.com\/?p=26576"},"modified":"2024-01-22T01:39:51","modified_gmt":"2024-01-22T00:39:51","slug":"presidents-letter-2023","status":"publish","type":"post","link":"https:\/\/cambridgesocietyofparis.com\/2023\/12\/26\/presidents-letter-2023\/","title":{"rendered":"President&#8217;s Letter 2023"},"content":{"rendered":"<p>Last year I wrote that “<em>the pandemic, and the broader halt on many of our more traditional events, gave us pause to reconsider our raison d’être and our Committee structure, and 2022 was a significant year of transition for us<\/em>”.<\/p>\n<p>Well, if 2022 was the year of transition, 2023 was certainly the year we found our feet again.<\/p>\n<p>An early highlight was undoubtedly dinner with Professor Robert Lethbridge, who provided a fascinating and candid account of his life as Master of Fitzwilliam, held at a sold-out Brasserie Bofinger.<\/p>\n<p>After a four-year hiatus, I am particularly pleased that we saw the return of the Cambridge and Oxford garden party, gathering alumni in late July at the British Ambassador’s residence. We welcomed Wesley Kerr OBE, former BBC Royal Correspondent and Trustee of London’s Royal Parks, who treated us to anecdotes from his time with Cambridge, the Royals, and the UK’s magnificent horticultural heritage. We hand over the baton to our friends at the Oxford Society for 2024’s edition.<\/p>\n<p>Into la rentrée, we hosted our now traditional welcome mixer for freshers embarking on their Cambridge adventure, back this time in the familiar surroundings of Bastille after the iconic Château de Longchamp – home of the Fondation Goodplanet &#8211; last year.<\/p>\n<p>October saw our annual dinner, later than usual but held as is now the tradition at La Maison des Polytechniciens. Lord Clement-Jones, former chair of the Liberal Party and chair of the All-Party Parliamentary Group on Artificial Intelligence, shone a light on AI, especially how we might govern its use.<\/p>\n<p>Our aim to restart more social and cultural events gathered momentum later in the year, starting with a wine sampling in Montmartre hosted by our newest committee member Nils Brockmann (more on that below) in November. This was such a success that we have already pencilled in a follow-up in February next year.<\/p>\n<p>As is customary, we were delighted that Edward Archer once again organised a sold-out Carols evening at The Travellers. And closing out the year in style, members were treated to a guided Van Gogh tour at the Musée d’Orsay in December, organised by our events head Vijay Phadke – yet another sell-out.<\/p>\n<p>Our friends at the Oxford Society are hosting their New Year dinner on 11<sup>th<\/sup> January, to which our members are welcome, where Stefania Giannini &#8211; Sous-Directrice Générale for Education at UNESCO &#8211; will give here thoughts on “Generation AI” and the Cambridge Society of Belgium invites our members to their 30<sup>th<\/sup> Anniversary dinner on 9<sup>th<\/sup> February, with Baroness Hale, former President of the UK Supreme Court as Speaker.<\/p>\n<p>We said goodbye to one member of the committee in 2023, with Maria Caro stepping down with our thanks and gratitude for all she has done for us since joining in 2021. In her place I am delighted to announce that that Nils Brockmann (Lucy Cavendish; 2021) was coopted onto the committee earlier this month. As we have seen, Nils has already hit the ground running. Sylvie Leger (Homerton; 1980) has also been providing counsel to committee meetings since the summer, and we hope that in the very near future we will be able to welcome her as a full committee member.<\/p>\n<p>A number of new initiatives previewed last year are close to fruition. Victoria Campion is leading the re-launch of our College Representatives scheme, fostering stronger bilateral relations between the Society and individual colleges and helping to coordinate College-level as well as University-wide events. Victoria is also leading the launch of a new Mentorship scheme, matching experienced alumni in France with younger counterparts hoping to benefit from their advice and friendship. Both of these programs are slowly taking shape and we hope to see them come fully to life in 2024.<\/p>\n<p>Finally, a note on the Trevor Brown Bursary. 2023 has been a year of reset, as we look to fill the enormous void left by Terry Quinn CBE FRS who has stood down as chair of the Bursary Committee. After a hiatus for 2023, we do hope to make several bursary awards in 2024, and your continued support is much appreciated by the Committee and by our recipients. More news on the Bursary and our plans will be shared in the coming weeks.<\/p>\n<p>On behalf of the Society and the wider Committee, I wish you all the very best for the New Year, and a prosperous 2024.<\/p>\n<p>Matthew Kay, President<\/p>\n<p>Emmanuel 2006<\/p>\n<p>president@camsocparis.org<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last year I wrote that “the pandemic, and the broader halt on many of our more traditional events, gave us pause to reconsider our raison d’être and our Committee structure, &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/cambridgesocietyofparis.com\/2023\/12\/26\/presidents-letter-2023\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;President&#8217;s Letter 2023&#8221;<\/span><\/a><\/p>\n","protected":false},"author":559,"featured_media":26579,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[217,1504769],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/cambridgesocietyofparis.com\/wp-content\/uploads\/2023\/12\/PARIS-Black.jpg?fit=771%2C202&ssl=1","amp_enabled":true,"ticketed":false,"_links":{"self":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts\/26576"}],"collection":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/users\/559"}],"replies":[{"embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/comments?post=26576"}],"version-history":[{"count":1,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts\/26576\/revisions"}],"predecessor-version":[{"id":26577,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts\/26576\/revisions\/26577"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/media\/26579"}],"wp:attachment":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/media?parent=26576"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/categories?post=26576"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/tags?post=26576"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}