{"id":26580,"date":"2022-12-31T22:00:42","date_gmt":"2022-12-31T21:00:42","guid":{"rendered":"https:\/\/cambridgesocietyofparis.com\/?p=26580"},"modified":"2024-01-22T01:42:03","modified_gmt":"2024-01-22T00:42:03","slug":"presidents-letter-2022","status":"publish","type":"post","link":"https:\/\/cambridgesocietyofparis.com\/2022\/12\/31\/presidents-letter-2022\/","title":{"rendered":"President&#8217;s Letter 2022"},"content":{"rendered":"<p><em>&#8220;The Cambridge Society of Paris serves past and present members of the University living or working in Paris. The 300 or so members can stay connected, keeping Cambridge close. The Society provides a wide variety of interesting, thought provoking, cultural and fun events where you can meet like-minded recent and seasoned alumni. We consolidate these ties with the University faculties by offering Bursaries to students needing to spend time in Paris researching their French-related projects.&#8221;<\/em><\/p>\n<p>The above “elevator summary”, outlining quite just what our Society exists to do, was approved by our Committee in March as part of a broader initiative to make sure the Society is fit for purpose in the coming years. The pandemic, and the broader halt on many of our more traditional events, gave us pause to reconsider our <em>raison d’être<\/em> and our Committee structure, and 2022 was a significant year of transition for us. Changes made place us in a fantastic position, we believe, as we usher in 2023.<\/p>\n<p>We said goodbye in July to our President, Terry Quinn, who had led us since 2020. When Terry was elected he had made it clear he saw his appointment as being short-term while we identified candidates from our younger members to help transform the Society. Fortunately for us Terry remains a member of the Society, and we hope to benefit from his wisdom for a long time yet.<\/p>\n<p>2022 saw other wider changes to the Committee, with both new faces and the creation of an Events Coordinator position (Vijay Phadke) as well as the formal re-establishment of a Vice President (Nicolas Nouvel). Tony Banton, a stalwart of the Society, switched from Secretary to Treasurer with the outgoing Treasurer, Matthew Kay, elected President. Rounding out the “Bureau”, we welcomed Jacques Li in 2022 as both a new Committee member and our new Secretary.<\/p>\n<p>A number of new initiatives are currently in development, and we hope to share details with you in the coming weeks and months. Victoria Campion will be leading a re-launch of our College Representatives scheme, fostering stronger bilateral relations between the Society and individual colleges and helping to coordinate College-level as well as University-wide events. Victoria is also leading the launch of a new Mentorship scheme, where we hope to match experienced alumni in France with younger counterparts hoping to benefit from their advice and friendship.<\/p>\n<p>Whilst events have been somewhat thinner than we had hoped after the summer, we are slowly but surely putting in place an exciting 2023 agenda – more on that in a moment. As for 2022, we were delighted that Edward Archer once again organised a sold-out Carols evening at The Travellers earlier this month, and I think all will agree that our annual dinner in April, where Sir Mark Walport took us through government pandemic decision-making, was a fascinating evening. We have some exciting events coming up, the highlight of which is a February dinner with Professor Robert Lethbridge who will lift the curtain on life as a College Master. Our friends at the Oxford Society are hosting a dinner in January, to which our members are welcome, where Miles Young &#8211; Warden of New College &#8211; will give his “thoughts on a New Year”. Details of our annual dinner, and the garden party held with the Oxford Society, will be shared in due course.<\/p>\n<p>Finally we are, as always, pleased to see the results of grants from the Trevor Brown Bursary. The Society welcomed Solange Manche, a recent recipient, to give a talk on her research at our AGM meeting, cementing a tradition from previous years. We hope to make several bursary awards in 2023, and your continued support is much appreciated by the Committee and by our recipients.<\/p>\n<p>Matthew Kay, President<\/p>\n<p>Emmanuel 2006<\/p>\n<p>president@camsocparis.org<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The Cambridge Society of Paris serves past and present members of the University living or working in Paris. The 300 or so members can stay connected, keeping Cambridge close. The &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/cambridgesocietyofparis.com\/2022\/12\/31\/presidents-letter-2022\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;President&#8217;s Letter 2022&#8221;<\/span><\/a><\/p>\n","protected":false},"author":559,"featured_media":26579,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[217,1504769],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/cambridgesocietyofparis.com\/wp-content\/uploads\/2023\/12\/PARIS-Black.jpg?fit=771%2C202&ssl=1","amp_enabled":true,"ticketed":false,"_links":{"self":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts\/26580"}],"collection":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/users\/559"}],"replies":[{"embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/comments?post=26580"}],"version-history":[{"count":1,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts\/26580\/revisions"}],"predecessor-version":[{"id":26581,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/posts\/26580\/revisions\/26581"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/media\/26579"}],"wp:attachment":[{"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/media?parent=26580"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/categories?post=26580"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cambridgesocietyofparis.com\/wp-json\/wp\/v2\/tags?post=26580"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}